app/controllers/graphs_controller.rb

SELECT "graphs".* FROM "graphs"
---
	def index
		@graphs = Graph.all

SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@graph = Graph.find(params[:id])

SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def edit
		@graph = Graph.find(params[:id])

INSERT INTO "graphs" ("file_name", "tax_level", "clade_num", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["file_name", "Biggraph"], ["tax_level", "genus"], ["clade_num", "14"], ["created_at", "2019-07-17 20:52:06.926193"], ["updated_at", "2019-07-17 20:52:06.926193"]]
---
	def create
		@graph = Graph.new(graph_params)

		if @graph.save

SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "graphs" SET "file_name" = ?, "clade_num" = ?, "updated_at" = ? WHERE "graphs"."id" = ?  [["file_name", "Small graph"], ["clade_num", "1"], ["updated_at", "2019-07-17 20:52:50.425196"], ["id", 4]]
---
	def update
		@graph = Graph.find(params[:id])

		if @graph.update(graph_params)

SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "graphs" WHERE "graphs"."id" = ?  [["id", 1]]
---
	def destroy
  		@graph = Graph.find(params[:id])
  		@graph.destroy